HELP_COMMAND = """
<b>/start</b> - <em>начать работу с ботом</em>
"""
WELCOME = 'Ознакомьтесь с очередью или войдите, чтобы записаться'
ENTER_CODE = 'Введите ваш уникальный код'
WRONG_CODE = 'Неверный код, попробуйте еще раз'
WRONG_CONTENT = 'Неккоректные данные, введите текст'
HELLO = 'Здравствуйте, <b>{}</b>, вы успешно авторизовались!'
USER_MENU = 'Выберите предмет'
ENTER_OLD_CODE = 'Введите старый код'
ENTER_NEW_CODE = '''
Введите новый код, соответствующий следующим требованиям:

• новый и старый коды отличаются
• длина от 4-ёх до 20-ти символов
• в коде содержатся только цифры и латинские буквы

'''
CODES_ARE_EQUAL = 'Новый код не отличается от старого, введите другой код'
TO_LONG_CODE = 'Код длиннее 20-ти символов, введите другой код'
TO_SHORT_CODE = 'Код короче 4-ёх символов, введите другой код'
BAD_SYMBOLS = 'В коде содержатся недопустимые символы, введите другой код'
NOT_ORIGINAL_CODE = 'Упс 😬 Такой код уже кто-то использует, придумай что-то другое'
CODE_CHANGED = 'Код успешно изменён, ваш новый код: '
ALREADY_IN_QUEUE = 'Вы уже в конце очереди'
INSERT_WHO = '\nКого вы хотите вписать? Введите номер из списка выше'
INSERT_WHERE = '\n\nНа какой номер в очереди поставить студента {}? Введите число'
WRONG_NUM = '\n\nНекорректный номер, попробуйте еще раз'
ITS_NOT_NUMBER = 'Это не число, введите число'
INCORRECT_NUM = 'Такой позиции нет в очереди'
INSERT_DONE = '\n\nСтудент {} успешно добавлен в очередь'
DELETE_WHO = '\n\nКого вы хотите удалить? Введите номер из списка выше'
DELETE_DONE = '\n\nСтудент {} успешно удалён из очереди'
WRONG_NUM_CONTENT = '\n\nНекорректные данные, введите номер текстом'
SWAP_WHO = '\n\nКого вы ходите поменять местами? Введите номер из списка выше'
SWAP_WITH_WHO = '\n\nС кем вы хотите поменять местами студента {}? Введите номер из списка выше'
SWAP_DONE = '\n\nСтудент {} и студент {} успешно поменялись местами'
ARE_YOU_SURE_DEL = 'Вы уверены, что хотите удалить себя из очереди?'
ARE_YOU_SURE_ADD = 'Вы уверены, что хотите перезаписать себя в конец очереди?'
QUEUE_IS_CLOSED = 'Очередь закрыта для записи'
QUEUE_IS_CLEAR = 'Очередь успешно очищена'
ARE_YOU_SURE_CLEAR = 'Вы уверены, что хотите очистить очередь?'
YOU_ALREADY_IN_QUEUE = 'Вы уже стоите в очереди'
YOU_NOT_IN_QUEUE_NOW = 'Вы уже не стоите в очереди'